Revit 2024 API
BuiltInFailures.KeynoteTagFailures.KeynoteOnLinkWithDifferentKeynoteFile Property
 The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId KeynoteOnLinkWithDifferentKeynoteFile { get; }
Visual Basic
Public Shared ReadOnly Property KeynoteOnLinkWithDifferentKeynoteFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ KeynoteOnLinkWithDifferentKeynoteFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeynoteTagFailures Class
Autodesk.Revit.DB Namespace